Configure/SF_Model/0/flowCondition
velocity	(%Ux% 0 0);
flowrate	%Q%;
k	%k%;
epsilon	%epsilon%;
nut	%nut%;
ks	%d50%;