Configure/SF_Model/system/controlDict_temp
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs (
      "libOpenFOAM.so"
     );

application			pimpleFoam;

startFrom			latestTime;
startTime			0;
stopAt				endTime;
endTime				%physicalTime%;
deltaT				%deltaT%;
writeControl		adjustableRunTime;
writeInterval		0.1;
purgeWrite			10;
writeFormat			binary;
timeFormat			general;
timePrecision		7;
runTimeModifiable	true;
adjustTimeStep		yes;
maxCo				%maxCo%;
maxDeltaT			%maxDeltaT%;

functions
{
	#includeFunc wallShearStress;
	#includeFunc yPlus;
	#includeFunc writeCellCentres;
}

// ************************************************************************* //
